/* 
   Localizable.strings
   NibUnlocker

   Created by Charles Srstka on 9/18/10.
   Copyright 2010 __MyCompanyName__. All rights reserved.
 */
 
"Warning" = "Warning";
"STARTUP_WARNING" = "This version of NibUnlocker is an alpha version. There may be bugs, and NibUnlocker may produce a .xib file that Xcode cannot open. If this happens, please let me know exactly what nib file this occurred with, and I will see if I can fix it. There is, however, no guarantee that NibUnlocker will work with any given nib file.\n\nIn addition, since compiled nibs do not contain all the information in the original .xib file, the .xib file created by NibUnlocker will not be a complete replacement for the original. It can be useful for examining a nib file and seeing how it is constructed, but it should not be used in a project to compile a new nib file, as doing so may have unpredictable results.\n\nAs with most software, there is no warranty for NibUnlocker. I cannot be held liable for any damage of any kind caused by the use of NibUnlocker, and by continuing to use this program, you agree to do so AT YOUR OWN RISK.";

"Save" = "Save";
 
"XIB_SAVEPANEL_STRING" = "Please choose a location to which to save the unlocked .xib file:";

"NIB_ALREADY_UNLOCKED" = "The NIB file “%@” is already designable and does not need to be unlocked.";
"OLD_NIB_FORMAT" = "The NIB file “%@” is of an obsolete format not supported by NibUnlocker.";
"WEIRD_NIB_FORMAT" = "The NIB file “%@” does not contain a keyedobjects.nib file. Perhaps it is of a later format that NibUnlocker does not yet recognize.";
"INVALID_NIB_FORMAT" = "The format of this nib file appears to be invalid.";